posts/pixel_phone_issue.html
<!DOCTYPE html><html><head><!-- 2026-01-03 --><!-- 2026-01-29 Thu 14:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My phone is dead and my learning</title>
<meta name="generator" content="Org Mode" />
<link href="https://fonts.cdnfonts.com/css/share-tech-mono" rel="stylesheet"><link rel="stylesheet" type="text/css" href="/assets/code.css"/><link rel="stylesheet" type="text/css" href="/assets/style.css"/>
</head><body><header><div class="container"><h1>Gold Ayan's Tinker Garage</h1></div><div class="header-content"><nav class="container"><ul class="topnav"><li><a href="/index.html">Home</a></li><li><a href="/projects.html">Projects</a></li><li><a href="/posts">Posts</a></li><li><a href="/til.html">TIL</a></li><li><a href="/blogrolls.html">Blogrolls</a></li><li><a href="/feed.xml">RSS</a></li></ul></nav></div></header><article class="container"><div class="blog-content"><p>
It was Saturday morning, and I thought of checking my WhatsApp status
and message on my Android phone, and the display went black. I can see
partial screen now and then, with a green line at the top, sometimes a
green square covering 1/3rd of the screen. My thoughts are holy crap,
not again, I need to buy or replace my phone again, as I got this
phone not a year ago.
</p>

<p>
After checking the phone, only the display is not working rest of the
functionality seems to be working. My company provides the phone I am
currently using, so I want talk to them first.
</p>

<p>
Okay, fine. Let's see what I can do in this situation and write 4
points.
</p>
<ol class="org-ol">
<li>E-sim issue
<ul class="org-ul">
<li>I need to find a device that has e-SIM capability, and a phone
with this capability is not cheap.</li>
<li>I have to go to the Airtel showroom (I did).</li>
<li>New proof, the problem is this in my father's name.</li>
</ul></li>
<li>Buy a new Android phone
<ul class="org-ul">
<li>A decent Android phone costs around 30K ruppees. It's a new year,
and I don't want to spend the bulk of my amount on a new mobile.</li>
<li>I know my primary sim is gone for a few days, so let's have an
emergency number for contact with family.</li>
<li>Why not buy a dumb keypad phone that supports all mobile
operators?</li>
<li>I bought the HMD 4G keypad mobile for 2400 rupees for emergency
contact with my family and friends.
<ul class="org-ul">
<li>I will write more about the HMD phone in a separate blog.</li>
</ul></li>
</ul></li>
<li>Backup important data
<ul class="org-ul">
<li>I charged the phone for 2 to 3 hours and prayed it would be back
to normal for a few minutes so I could back up important data.</li>
<li>Photos, Documents, and some videos.</li>
<li>It came back to normal, then plugged into my laptop and gave file
transfer permission.</li>
</ul></li>
<li>Enable USB debugging and wireless debugging for screen mirroring.
<ul class="org-ul">
<li>Parallely, when backing up, I have enabled USB debugging and
wireless debugging.</li>
<li>Done adb pairing with laptop using <b><b>adb pair &lt;ip addr&gt;:&lt;port&gt;</b></b></li>
<li>Downloaded <b><b>scrcpy</b></b> static binary build and I can screen mirror
it in laptop woooh SAFEEE..</li>
<li>To keep the screen awake, I installed <b><b>caffinate</b></b> from F-Droid.</li>
</ul></li>
</ol>

<div id="outline-container-org750c7de" class="outline-2">
<h2 id="org750c7de">After some time</h2>
<div class="outline-text-2" id="text-org750c7de">
<p>
After a while, my phone seems to be back to normal after I keep the
phone turned on for a day (caffinate app). So I guess the issue is
software, I have factory reset the phone, now it works properly, but
still the display flickers.
</p>
</div>
</div>

<div id="outline-container-org23760d3" class="outline-2">
<h2 id="org23760d3">Learnings</h2>
<div class="outline-text-2" id="text-org23760d3">
<ul class="org-ul">
<li>Have an emergency dumb phone. You can get one for less than 3000 rupees.</li>
<li>I don't plan on using E-sim here after (Until it is available in a
mid-budget phone).</li>
<li>You can enable default option to be done when USB is connected in developer settings.
<ul class="org-ul">
<li>If developer settings is enabled some app won't work - IRCTC, Banking apps.</li>
</ul></li>
<li>JIO SIM won't work unless it is a 4G phone.</li>
</ul>
</div>
</div>
</div></article><footer>This site is made with ❤️ using Emacs.</footer></body></html>
